import FaqContent from "./Components/FaqComponent";

export const revalidate = 86400;

export default function FAQPage() {
  const faqData = [
    {
      q: "⁠What is this Zero Olympiad?",
      a: "Zero Olympiad হলো একটি শিক্ষামূলক ও প্রতিযোগিতামূলক প্ল্যাটফর্ম, যেখানে শিক্ষার্থীরা বৈশ্বিক সমস্যা, উদ্ভাবন, নেতৃত্ব ও টেকসই উন্নয়ন নিয়ে শেখার ও প্রতিযোগিতা করার সুযোগ পায়। এখানে বিভিন্ন রাউন্ড, প্রশিক্ষণ, মেন্টরশিপ ও চ্যালেঞ্জের মাধ্যমে অংশগ্রহণকারীরা নিজেদের দক্ষতা উন্নত করতে পারে এবং সমাজের জন্য ইতিবাচক পরিবর্তনে ভূমিকা রাখতে অনুপ্রাণিত হয়। আপনি চাইলে আমি রেজিস্ট্রেশন, ক্যাটাগরি বা প্রতিযোগিতার ধাপগুলো সম্পর্কে বিস্তারিত জানাতে পারি।",
    },
    {
      q: "How to register?",
      a: "জিরো অলিম্পিয়াডের ওয়েবসাইট zeroolympiad.com এ গেলেই আপনি রেজিস্ট্রেশন লিংক ও অন্যান্য আনুষাঙ্গিক তথ্য পেয়ে যাবেন। আপনি চাইলে আমি ওয়েবসাইট লিংক আপনার এই নাম্বারে হোয়াটসঅ্যাপ করতে পারি।",
    },
    {
      q: "রেজিস্ট্রেশন এর পরের ধাপ কি? ",
      a: "রেজিস্ট্রেশন এর সাথে সাথেই আপনি একটি অটোমেটিক ইমেইল পাবেন। সেই ইমেইলেই জাতিসংঘের কোর্স করার লিংক ও অন্যান্য বিস্তারিত তথ্য থাকবে। ",
    },
    {
      q: "What is the Registration fee?",
      a: "রেজিস্ট্রেশন ফি ৪০০ টাকা। কিন্তু পবিত্র রমজান উপলক্ষ্যে আমাদের তরফ থেকে Ramadan Reward হিসেবে আপনি ৩০০ টাকা দিয়ে রেজিস্ট্রেশন করতে পারবেন। রমজানের পরে আবার রেজিস্ট্রেশন ফি যথারীতি ৪০০ টাকা পরিশোধ করতে হবে।",
    },
    {
      q: "Since UN Course is free, why is this Registration Fee?",
      a: "জিরো অলিম্পিয়াডের তরফ থেকে আপনাদের জন্য যেহেতু অনেক অনেক পুরস্কার যেমন বিদেশে বুটক্যাম্প, নগদ অর্থ পুরস্কার, ক্রেস্ট, ট্রফি, সার্টিফিকেট ইত্যাদি রাখা হয়েছে, তাই এসবের খরচ বাবদ এই ফি রাখা হয়েছে। এছাড়াও ৬ জুন যে গ্র্যান্ড ফাইনাল অনুষ্ঠিত হবে সেখানে লজিস্টিকস, আপ্যায়ন, বিদেশী অতিথিদের ট্রাভেল এবং একোমোডেশন এর খরচও রয়েছে।",
    },
    {
      q: "What will I learn from these courses?",
      a: `আপনার ক্যাটাগরি অনুযায়ী জাতিসংঘ থেকে আপনাকে ভিন্ন ভিন্ন কোর্স করানো হবে।
        Class 5 – Class 8 SDG 1 – SDG 4: Sport For Climate Action https://unccelearn.org/course/view.php?id=215&page=overview

        Class 9 – University Admission Candidate SDG 5 – SDG 10: Becoming A Climate Champion https://unccelearn.org/course/view.php?id=201&page=overview

        Bachelor – Masters and above SDG 11 – SDG 17: Scaling Climate Finance https://unccelearn.org/course/view.php?id=205&page=overview`,
    },
    {
      q: "I am a Bangla Medium student is it possible for me to complete the course?",
      a: "যদিও জাতিসংঘ থেকে এই কোর্স ইংরেজিতে করানো হয়, আমরা বাংলা ও ইংরেজি দুই ভাষাতেই আমাদের পরীক্ষায় অংশগ্রহণের সুযোগ রাখছি। জাতিসংঘ কোর্স ইংরেজিতে করতে অসুবিধা হলে",
    },
    {
      q: "What will be the Question pattern?",
      a: "১ম রাউন্ডে ৩০টি এমসিকিউ প্রশ্ন থাকবে। জাতিসংঘ থেকে যেই কোর্স আপনারা করবেন, সেখান থেকেই প্রশ্ন থাকবে। ২য় রাউন্ডে যার যার ক্লাস/গ্রেড অনুযায়ী নির্ধারিত এসডিজি’র উপরে ৩ মিনিটের ভিডিও তৈরী করবেন।",
    },
    {
      q: "Finished my masters degree can I join?",
      a: "জ্বী পারবেন, আপনার এসডিজি হবে SDG17.",
    },
    {
      q: "I live outside Bangladesh. Can I participate?",
      a: "জ্বী পারবেন, পৃথিবীর যে কোন দেশ থেকেই পারবেন। গতবার আমাদের গ্র্যান্ড ফাইনালেতে চায়না, মালয়েশিয়া, কাতার, ইংল্যান্ড ও অস্ট্রেলিয়ার পার্টিসিপেন্ট ছিল।",
    },
  ];

  return <FaqContent faqs={faqData} />;
}